tutorials/multiphase/interDyMFoam/ras/sloshingTank3D3DoF/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

m4 constant/polyMesh/blockMeshDict.m4 > constant/polyMesh/blockMeshDict
runApplication blockMesh
cp 0/alpha1.org 0/alpha1
runApplication setFields
runApplication interDyMFoam
